# Indexing & Selection in Pandas

In [2]:
import pandas as pd
import numpy  as np

In [3]:
data=pd.DataFrame(
    np.arange(16).reshape(4,4),
    index=["London","Paris",
           "Berlin","Istanbul"],
    columns=["one","two","three","four"])
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [5]:
# data[0] #error!

In [6]:
data[0:1] #0th index-1st row

        one  two  three  four
London    0    1      2     3

## Selecting with iloc and loc

In [8]:
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [ ]:
# iloc --> integer based indexing

In [9]:
data.iloc[0,0] #rows,column!

0

In [10]:
data.iloc[2,3]

11

In [11]:
data.iloc[0:,3]

London       3
Paris        7
Berlin      11
Istanbul    15
Name: four, dtype: int64

In [12]:
#  loc --> label based indexing

In [13]:
data.head()

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [ ]:
data.loc["pa"]